[
  {
    "id": "cod",
    "commonName": "Cod",
    "scientificName": "Gadus morhua",
    "family": "Gadidae (Cod Family)",
    "description": "A classic bottom-dwelling fish, easily recognised by its mottled green or sandy brown back, a distinctive single barbel on its chin, and a prominent white lateral line. They are powerful fish, especially when they reach larger sizes.",
    "habitatAndBehaviour": "Cod prefer cooler, deeper water and are often found over rough, broken ground, reefs, and wrecks. They are voracious predators, feeding on a wide variety of food including worms, crabs, shellfish, and smaller fish.",
    "minimumSizeCm": 35,
    "conservationNote": "North Sea and Atlantic cod stocks have been under significant pressure. Many anglers advocate for returning fish under 50-60cm to allow them to grow to breeding size.",
    "identificationNote": "Can be confused with Pollack or Coalfish, but the chin barbel is the key giveaway.",
    "baits": ["Black Lugworm", "Squid", "Peeler Crab", "Mackerel", "Mussel", "Hermit Crab"],
    "lures": ["Shads", "Jigs", "Pirks"],
    "rig": "Pulley Pennel / 2-Hook Flapper"
  },
  {
    "id": "bass",
    "commonName": "Bass",
    "scientificName": "Dicentrarchus labrax",
    "family": "Moronidae (Temperate basses)",
    "description": "A prized sport fish renowned for its fighting qualities. It has a streamlined, silver body with a darker blue-grey back and a cream or white belly. Key identifying features include two distinct dorsal fins—the first being spiny and sharp.",
    "habitatAndBehaviour": "Adaptable predators found in a range of coastal habitats, from shallow estuaries and surf beaches to deeper water over reefs and wrecks. They often feed aggressively in turbulent water.",
    "minimumSizeCm": 42,
    "conservationNote": "A very slow-growing species. Strict regulations govern recreational bass fishing, including a closed season for retention (catch and release only), a higher minimum legal size, and strict bag limits (e.g., two fish per angler per day) during the open season. Anglers must check current legislation.",
    "baits": ["Peeler Crab", "Lugworm", "Sandeel", "Mackerel Head", "Live Prawn"],
    "lures": ["Surface Poppers", "Shallow Diving Plugs", "Soft Plastic Eels", "Weedless Minnows"],
    "rig": "Running Ledger / 1-Hook Flapper"
  },
  {
    "id": "pollack",
    "commonName": "Pollack",
    "scientificName": "Pollachius pollachius",
    "family": "Gadidae (Cod Family)",
    "description": "A powerful predator with a coppery-brown back, large eyes, and a distinctly underslung lower jaw. Its lateral line has a noticeable curve over the pectoral fin.",
    "habitatAndBehaviour": "Pollack are ambush predators that live in and around structures like deep-water rock marks, kelp forests, reefs, and wrecks. They hunt in mid-water, darting out from cover.",
    "minimumSizeCm": 30,
    "baits": ["Sandeel", "Mackerel Strip", "Ragworm"],
    "lures": ["Soft Plastic Eels (e.g., Sidewinder)", "Metal Jigs", "Spinners"],
    "rig": "Float Fishing / Flowing Trace"
  },
  {
    "id": "mackerel",
    "commonName": "Mackerel",
    "scientificName": "Scomber scombrus",
    "family": "Scombridae (Mackerel Family)",
    "description": "A beautifully streamlined, torpedo-shaped fish with a blue-green back marked with distinctive wavy black bars. They are a shoaling species, often appearing in vast numbers.",
    "habitatAndBehaviour": "A pelagic (mid-water) species that migrates towards the coast in huge shoals during the summer to feed on sandeels, sprats, and other small fish.",
    "minimumSizeCm": 30,
    "conservationNote": "The MCRS is 30cm in the North Sea area, and 20cm elsewhere, but it's good practice to adhere to 30cm everywhere. Only take what you need for bait or the table.",
    "baits": ["Mackerel Strip", "Sandeel"],
    "lures": ["Feathers", "Daylights", "Small Metal Spinners"],
    "rig": "Feather Rig / Float Fishing"
  },
  {
    "id": "ballan_wrasse",
    "commonName": "Ballan Wrasse",
    "scientificName": "Labrus bergylta",
    "family": "Labridae (Wrasse Family)",
    "description": "A powerful, stocky fish with large scales, fleshy lips, and strong teeth designed for crushing shells. Their colour is highly variable, ranging from deep greens and browns to mottled oranges and reds.",
    "habitatAndBehaviour": "Strongly territorial and live in heavy kelp beds, rocky ground, and around man-made structures like pier legs. They are aggressive feeders, preying on crabs, shellfish, and prawns.",
    "minimumSizeCm": 23,
    "conservationNote": "A very slow-growing fish. Best practice is catch and release to protect local populations.",
    "baits": ["Peeler Crab", "Hardback Crab", "Ragworm", "Prawns"],
    "lures": ["Weedless Soft Plastics (Creature Baits)", "Jig Heads"],
    "rig": "Float Fishing / Strong Running Ledger"
  },
  {
    "id": "plaice",
    "commonName": "Plaice",
    "scientificName": "Pleuronectes platessa",
    "family": "Pleuronectidae (Right-eye flounders)",
    "description": "A diamond-shaped flatfish with smooth skin, easily identified by the bright orange or red spots on its dark, upward-facing side. The underside is pearly white.",
    "habitatAndBehaviour": "Plaice live on clean, sandy or muddy seabeds. They bury themselves in the sand to hide from predators and ambush prey like worms and small crustaceans.",
    "minimumSizeCm": 27,
    "identificationNote": "Can be confused with other flatfish like Flounder or Dab. The bright orange spots are the clearest identifier.",
    "baits": ["Lugworm", "Ragworm", "Mussel", "Sandeel", "Razorfish"],
    "lures": [],
    "rig": "2 or 3-Hook Flapper Rig (often with beads/sequins as attractors)"
  },
  {
    "id": "thornback_ray",
    "commonName": "Thornback Ray",
    "scientificName": "Raja clavata",
    "family": "Rajidae (Skates and Rays)",
    "description": "A kite-shaped cartilaginous fish. Its upper side is mottled brown and grey for camouflage, and is covered in numerous sharp spines or 'thorns', especially along the back and tail.",
    "habitatAndBehaviour": "Bottom feeders, typically found over sand, mud, and mixed ground. Common in estuaries, deep-water channels, and off open beaches.",
    "minimumSizeCm": 45,
    "conservationNote": "The MCRS is measured from wingtip to wingtip. Anglers should handle them with extreme care to avoid the sharp thorns and return them to the water as quickly as possible.",
    "baits": ["Sandeel", "Bluey", "Mackerel Head/Flapper", "Squid"],
    "lures": [],
    "rig": "Pulley Pennel / Running Ledger"
  },
  {
    "id": "smooth_hound",
    "commonName": "Smooth-hound",
    "scientificName": "Mustelus mustelus",
    "family": "Triakidae (Houndshark Family)",
    "description": "A sleek, powerful, shallow-water shark. It has a classic shark profile with a grey-brown back fading to a white belly. Instead of sharp teeth, they have blunt, powerful crushing plates.",
    "habitatAndBehaviour": "Typically found over sandy, shingle, and light broken ground, where they actively hunt for crustaceans, especially crabs and lobsters.",
    "minimumSizeCm": 0,
    "conservationNote": "No official MCRS, but catch and release is strongly encouraged to protect stocks.",
    "baits": ["Peeler Crab", "Hardback Crab", "Squid"],
    "lures": [],
    "rig": "Pulley Rig / Running Ledger"
  },
  {
    "id": "whiting",
    "commonName": "Whiting",
    "scientificName": "Merlangius merlangus",
    "family": "Gadidae (Cod Family)",
    "description": "A slender member of the cod family, recognised by its silvery body and a small but distinct dark blotch at the base of each pectoral fin.",
    "habitatAndBehaviour": "Found over a variety of seabeds, including mud, sand, and gravel. They are aggressive shoaling predators that move into shallower water to feed in winter.",
    "minimumSizeCm": 27,
    "baits": ["Mackerel Strip", "Lugworm", "Squid", "Sandeel"],
    "lures": [],
    "rig": "2 or 3-Hook Flapper"
  },
  {
    "id": "sole",
    "commonName": "Dover Sole",
    "scientificName": "Solea solea",
    "family": "Soleidae (True Sole Family)",
    "description": "A tongue-shaped flatfish with a rounded snout and a small, curved mouth. Its colour is a uniform dark or sandy brown.",
    "habitatAndBehaviour": "Lives on sandy or muddy seabeds, often partially burying itself during the day and becoming more active at night.",
    "minimumSizeCm": 24,
    "baits": ["Lugworm", "Ragworm"],
    "lures": [],
    "rig": "2-Hook Flapper"
  },
  {
    "id": "bream_black",
    "commonName": "Black Bream",
    "scientificName": "Spondyliosoma cantharus",
    "family": "Sparidae (Sea Bream Family)",
    "description": "A deep-bodied, silvery-grey fish that turns almost black during spawning season. A popular sport fish known for strong fights.",
    "habitatAndBehaviour": "Found over rough ground and reefs, migrating inshore to spawn in spring.",
    "minimumSizeCm": 23,
    "baits": ["Ragworm", "Squid Strips", "Maddocks"],
    "lures": ["Small Metal Jigs"],
    "rig": "2-Hook Flapper"
  },
  {
    "id": "conger_eel",
    "commonName": "Conger Eel",
    "scientificName": "Conger conger",
    "family": "Congridae (Conger Eel Family)",
    "description": "A large, powerful marine eel with a long, cylindrical, scaleless body. It is typically slate-grey or blue-black on its back, fading to a lighter, off-white belly.",
    "habitatAndBehaviour": "Nocturnal predators that inhabit holes and crevices in rough ground, wrecks, piers, and harbour walls. They emerge at night to hunt for fish, crabs, and cephalopods.",
    "minimumSizeCm": 0,
    "conservationNote": "No MCRS. Best practice is to handle with extreme care and return large specimens.",
    "baits": ["Mackerel Head/Flapper", "Whole Squid", "Cuttlefish", "Bluey"],
    "lures": [],
    "rig": "Heavy Running Ledger / Pulley Rig with wire trace"
  },
  {
    "id": "dogfish_lesser_spotted",
    "commonName": "Lesser-Spotted Dogfish",
    "scientificName": "Scyliorhinus canicula",
    "family": "Scyliorhinidae (Catshark Family)",
    "description": "One of the most common shark species in UK waters. It has a slender body, a blunt head, and famously rough skin. The colour is sandy brown or grey, covered in numerous small, dark spots.",
    "habitatAndBehaviour": "An abundant bottom-dweller, found over sandy, gravelly, and muddy seabeds. It is an opportunistic scavenger.",
    "minimumSizeCm": 0,
    "baits": ["Mackerel", "Squid", "Lugworm", "Ragworm", "Bluey"],
    "lures": [],
    "rig": "2 Hook Flapper / Running Ledger"
  },
  {
    "id": "flounder",
    "commonName": "Flounder",
    "scientificName": "Platichthys flesus",
    "family": "Pleuronectidae (Right-eye Flounder Family)",
    "description": "The defining characteristic is the texture of the skin, which has rows of rough, bony tubercles. Their colour is typically a drab olive-brown or grey.",
    "habitatAndBehaviour": "Famously tolerant of low-salinity water, Flounder are abundant in estuaries and tidal rivers, as well as on muddy and sandy shorelines.",
    "minimumSizeCm": 25,
    "baits": ["Ragworm", "Peeler Crab", "Maddocks", "Harbour Ragworm"],
    "lures": [],
    "rig": "2/3 Hook Flapper / Flowing Trace"
  },
  {
    "id": "dab",
    "commonName": "Dab",
    "scientificName": "Limanda limanda",
    "family": "Pleuronectidae (Right-eye Flounder Family)",
    "description": "Distinguished by its lateral line, which has a distinct, high curve over the pectoral fin. Its skin feels rough like fine sandpaper if stroked from tail to head.",
    "habitatAndBehaviour": "A common inhabitant of shallow, sandy bottoms, often found in large numbers.",
    "minimumSizeCm": 20,
    "baits": ["Lugworm", "Mackerel Strip", "Ragworm"],
    "lures": [],
    "rig": "2/3 Hook Flapper"
  },
  {
    "id": "coalfish",
    "commonName": "Coalfish",
    "scientificName": "Pollachius virens",
    "family": "Gadidae (Cod Family)",
    "description": "Also known as Saithe, the Coalfish has a dark, greenish-black back and bright silvery flanks. Its definitive identifying feature is its pale, straight lateral line.",
    "habitatAndBehaviour": "Coalfish share a preference for rocky ground and wrecks with Pollack but are more prone to forming large shoals, especially when young.",
    "minimumSizeCm": 35,
    "baits": ["Mackerel Strip", "Ragworm", "Sandeel"],
    "lures": ["Small Spinners", "Feathers", "Daylights"],
    "rig": "Spinning / 3-Hook Flapper"
  }
]
